/*
namespace Learn_UrFU
{
    internal class Split_join
    {
        public static string ReplaceIncorrectSeparators(string text)
        {
            string[] splits = new string[] { " ", ";", "-", ":", ",", "\t\t" };

            for (int i = 0; i < splits.Length; i++)
                while(text.Contains(splits[i]))
                    text = text.Replace(splits[i], "\t");
            
            return text;
        }

        public static void Main()
        {
            string citiesPopulation = "Страна Население Дата %\r\nКитай: 1405023000; 24.08.2020; 17.99%\r\nИндия: 1375100000 24.08.2020 17.6%\r\nСША: 329957441; 15.07.2020; 4.24%\r\nИндонезия 266911900; 01.07.2019 3.42%\r\nПакистан - 218647040 24.08.2020; 2.8%\r\nБразилия 211950300; 24.08.2020; 2.71%\r\nНигерия 208426036; 24.08.2020; 2.67%\r\nБангладеш 171147762 24.08.2020; 2.19%\r\nРоссия: 146748590; 01.01.2020 1.88%\r\nМексика - 127792286, 01.07.2020, 1.64%\r\nЯпония 125950000; 01.03.2020, 1.61%\r\nЭфиопия 112079000, 01.07.2019 1.43%\r\nФилиппины 108968790, 24.08.2020; 1.39%\r\nЕгипет 100812120, 24.08.2020 1.29%\r\nВьетнам 96208984; 01.04.2019; 1.23%\r\nДРК 86791000, 01.07.2019, 1.11%\r\nИран 84393386 24.08.2020 1.08%\r\nТурция - 83154997 1.01.2020 1.06%\r\nГермания - 83149300 1.10.2019 1.06%\r\nФранция - 68859599; 01.01.2018, 0.88%";
            //string citiesPopulation = "Страна Население Дата %\r\nКитай: 1405023000; 24.08.2020; 17.99%\r\n";
            Console.WriteLine(ReplaceIncorrectSeparators(citiesPopulation));
        }
    }
}*/
